Repository: yingsiulau/typo3-webshop
Catalog: var/labels/*/webhooks/Resources/Private/Language/*.locallang_db.xlf
Languages: de

# sys_webhook.name.description
source: Meaningful name of the webhook
de: Aussagekräftiger Name des Webhook

# sys_webhook.url.description
source: Target URL that should be called.
de: Ziel-URL, die aufgerufen werden soll.

# sys_webhook.method
source: HTTP Method
de: HTTP-Methode

# sys_webhook.verify_ssl
source: Verify SSL
de: SSL verifizieren

# sys_webhook.verify_ssl.description
source: Verify that the connection is secure and valid, this setting should only be disabled in case a verification is not possible.
de: SSL-Verbindung verifizieren. Sollte nur deaktiviert sein, falls eine Verifikation nicht möglich ist.

# sys_webhook.additional_headers
source: Additional Headers
de: Zusätzliche Header

# sys_webhook.additional_headers.description
source: Additional headers that should be added to the HTTP request. Data must be provided as valid JSON string.
de: Zusätzliche Header, die zum HTTP-Request hinzugefügt werden sollen. Daten müssen als valider JSON-String gegeben werden.

# sys_webhook.identifier.description
source: This is your unique webhook identifier
de: Dies ist der eindeutige Webhook-Identifier

# sys_webhook.webhook_type
source: Webhook Trigger
de: Webhook-Auslöser

# sys_webhook.secret.description
source: The secret is mandatory to create a hash that is sent with the request. The secret can be used to verify the payload has not been modified, see the documentation for more details.
de: Das Secret ist zwingend nötig um einen Hash zu erstellen, der mit der Anfrage gesendet wird. Das Secret kann benutzt werden um die Payload gegen Veränderungen verifizieren zu können. In der Dokumentation sind weitere Informationen.

# sys_webhook.secret.passwordGenerator
source: Generate secret
de: Secret generieren

# sys_webhook.webhook_type.description
source: Trigger the webhook, ...
de: Trigger den Webhook, ...

# sys_webhook.webhook_type.select
source: Select a trigger
de: Auslöser auswählen

# sys_webhook.webhook_type.typo3-content-page-modification
source: ... when a page is added or changed
de: ... wenn eine Seite hinzugefügt oder geändert wird

# sys_webhook.webhook_type.typo3-login-error
source: ... when an error occurs on log in
de: ... wenn bei der Anmeldung ein Fehler auftritt

# sys_webhook.webhook_type.typo3-mfa-error
source: ... when an error occurs on multi-factor authentication
de: ... wenn ein Fehler bei der Multi-Faktor-Authentifizierung auftritt

# sys_webhook.webhook_type.typo3-file-added
source: ... when a file is added
de: ... wenn eine Datei hinzugefügt wird

# sys_webhook.webhook_type.typo3-file-removed
source: ... when a file is removed
de: ... wenn eine Datei entfernt wird

# sys_webhook.webhook_type.typo3-file-updated
source: ... when a file is updated
de: ... wenn eine Datei aktualisiert wird

# sys_webhook.storage_pid
source: Storage PID
de: Ordner/Seite zur Speicherung der Einträge

# sys_webhook.storage_pid.description
source: Select the page on which a new record is created on.
de: Wähle die Seite, auf der ein neuer Datensatz erstellt wird.

# palette.config
source: Configuration
de: Konfiguration

# palette.config.description
source: General configuration of the webhook.
de: Allgemeine Konfiguration dieses Webhooks.

# palette.http_settings
source: HTTP Settings
de: HTTP Einstellungen

# palette.http_settings.description
source: Advanced HTTP request settings.
de: Erweiterte HTTP-Request-Einstellungen.

# palette.additional
source: Additional configuration
de: Zusätzliche Konfiguration

# palette.additional.description
source: Specific configuration for the selected webhook type
de: Spezifische Konfiguration für den ausgewählten Webhook-Typ
