Repository: yingsiulau/typo3-webshop
Catalog: var/labels/*/reactions/Resources/Private/Language/*.locallang_db.xlf
Languages: de

# sys_reaction.name.description
source: Meaningful name of the reaction
de: Aussagekräftiger Name

# sys_reaction.identifier
source: Identifier
de: Eindeutige Kennung

# sys_reaction.identifier.description
source: This is your unique reaction identifier within the TYPO3 URL
de: Das ist die eindeutige Kennung dieser Reaction in der TYPO3 URL

# sys_reaction.secret
source: Secret
de: Geheimer Schlüssel

# sys_reaction.secret.description
source: The secret is required to call the reaction from the outside. The secret can be re-created anytime, but will only be visible once (until the record got saved).
de: Der geheime Schlüssel ist erforderlich, um die Reaction von außerhalb aufzurufen. Der geheime Schlüssel kann jederzeit neu erstellt werden, ist aber nur einmal sichtbar (bis der Datensatz gespeichert wurde).

# sys_reaction.secret.passwordGenerator
source: Generate secret token
de: Geheimen Schlüssel erzeugen

# sys_reaction.reaction_type
source: Reaction Type
de: Typ

# sys_reactions.reaction_type.description
source: Select the reaction type to be configured.
de: Wählen Sie den zu konfigurierenden Typ der Reaction.

# sys_reaction.reaction_type.select
source: Select a reaction
de: Typ auswählen

# sys_reaction.reaction_type.create_record
source: Create database record
de: Datensatz erstellen

# sys_reaction.impersonate_user
source: Impersonate User
de: Benutzer imitieren

# sys_reaction.impersonate_user.description
source: Select the user with the appropriate access rights that is allowed to add a record of this type. If in doubt, use the CLI user.
de: Wählen Sie den Benutzer mit entsprechenden Zugriffsrechten, der einen Datensatz dieses Typs erstellen darf. Im Zweifelsfall verwenden Sie den CLI-Benutzer.

# sys_reaction.table_name
source: Table
de: Tabelle

# sys_reaction.table_name.description
source: Select one tables to display the corresponding fields.
de: Wählen Sie eine Tabelle aus, um die entsprechenden Felder anzuzeigen.

# sys_reaction.table_name.select
source: Select a table
de: Tabelle auswählen

# sys_reaction.storage_pid
source: Storage PID
de: Ordner/Seite zur Speicherung der Einträge

# sys_reaction.storage_pid.description
source: Select the page on which a new record is created on.
de: Wähle die Seite, auf der ein neuer Datensatz erstellt wird.

# sys_reaction.fields
source: Fields
de: Felder

# sys_reaction.fields.description
source: The available fields depend on the selected table. The usage of placeholders like ${foo.bar} is possible.
de: Die verfügbaren Felder hängen von der ausgewählten Tabelle ab. Die Verwendung von Platzhaltern wie ${foo.bar} ist möglich.

# palette.config
source: Configuration
de: Konfiguration

# palette.config.description
source: General configuration of the reaction.
de: Allgemeine Konfiguration dieser Reaction.

# palette.additional
source: Additional configuration
de: Zusätzliche Konfiguration

# palette.additional.description
source: Specific configuration for the selected reaction type
de: Spezifische Konfiguration für den ausgewählten Reaktionstyp

# fieldMapElement.noFields
source: The selected table '%s' does not define any valid fields to be configured.
de: Die ausgewählte Tabelle '%s' enthält keine gültigen Felder, die konfiguriert werden können.
